<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.1//EN" "http://www.w3.org/TR/xhtml11/DTD/xhtml11.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="fr">
  <head>
    <title>Formation: JavaScript Initiation - Formation JavaScript Initiation</title>
    <meta http-equiv="content-type" content="text/html; charset=utf-8" />
    <link rel="stylesheet" type="text/css" href="css/33d0c34f96e6afed4baa666fd7bfab67.css" media="all"/>
    <link rel="stylesheet" type="text/css" href="css/f786f0fa752fdc2603a99d15b85cb5fd.css" media="all and (orientation: portrait)"/>
  </head>
  <body>
    <div class="chapitre-content" id="ch_00">
      <h2>
        <span>Formation:</span>
        <a>JavaScript Initiation</a>
      </h2>
      <div class="content-box">
        <h4>La formation</h4>
        <p>La formation JavaScript Initiation propos&#xE9;e partout en France au sein de centres de formation agr&#xE9;&#xE9;s est anim&#xE9;e par un consultant professionnel sur les techniques enseign&#xE9;es. Les programmes peuvent diff&#xE9;rer d'un centre &#xE0; l'autre mais s'appliquent tous &#xE0; un contenu de trois sessions de 7 heures r&#xE9;parties sur trois jours cons&#xE9;cutifs. Cet ouvrage propose de suivre la formation au travers d'un support &#xE9;crit reprenant le programme qui lui est affect&#xE9;.</p>
        <p>Chaque th&#xE8;me est abord&#xE9; de la mani&#xE8;re la plus directe et la plus pr&#xE9;cise possible en rythmant phases d'explications, de code, de mise en garde et de conseils avis&#xE9;s. Dans cet ouvrage ne se trouvent pas de longues phases d'&#xE9;crits pouvant se synth&#xE9;tiser mais directement leur essence gr&#xE2;ce &#xE0; un soin tout particulier apport&#xE9; au choix du vocabulaire et la qualification du contenu.</p>
        <p>En l&#x2019;absence de formateur il est important de respecter les conditions de la formation, chaque exemple fourni doit &#xEA;tre ex&#xE9;cut&#xE9; puis mis en parall&#xE8;le avec les conseils pr&#xE9;sents dans l'ouvrage, une lecture seule peut ne pas suffire &#xE0; leur compr&#xE9;hension, ils sont un pr&#xE9;texte &#xE0; la pratique et repr&#xE9;sentent le moment o&#xF9; le stagiaire doit v&#xE9;rifier la transmission des connaissances. Pour suivre le stage, un &#xE9;diteur de code ou un environnement de d&#xE9;veloppement doit &#xEA;tre install&#xE9; comme Notepad++ ou JavaScript Development Tools d'eclipse.</p>
      </div>
      <h3 id="c_00_public">Public</h3>
      <div class="content-box">
        <h4>Int&#xE9;grateurs</h4>
        <p>La formation s'adresse &#xE0; un public averti de personnes souhaitant se diriger vers le m&#xE9;tier d'int&#xE9;grateur web, web designer, user interface designer et user experience designer, de web masters sur des syst&#xE8;mes de gestion de contenu (CMS) d&#xE9;sirant am&#xE9;liorer ou ajouter des fonctionnalit&#xE9;s via des programmes sp&#xE9;cifiques ou toute personne int&#xE9;ress&#xE9;e par les les technologies du web d&#xE9;sirant utiliser un langage Client-Side.</p>
        <strong>Pr&#xE9;requis</strong>
        <p>Les stagiaires doivent &#xEA;tre initi&#xE9;s ou ma&#xEE;triser un langage de type markup comme HTML et les feuilles de style en cascade de niveau 2. Plus g&#xE9;n&#xE9;ralement l'outil informatique doit &#xEA;tre familier tout comme la navigation sur le web. Il reste possible de suivre cette formation sans ces notions &#xE0; condition que des informations compl&#xE9;mentaires au programme soient recherch&#xE9;es tout au long de l'ouvrage.</p>
      </div>
      <h3 id="c_00_objectif">Objectif</h3>
      <div class="content-box">
        <h4>Bonnes pratiques</h4>
        <p>L'objectif du livre est de familiariser les stagiaires avec le langage JavaScript afin de maitriser ses bases et la manipulation d'un document via la programmation &#xE9;v&#xE8;nementielle. Compos&#xE9; en parties th&#xE9;matiques, le premier th&#xE8;me am&#xE8;ne &#xE0; d&#xE9;couvrir la grammaire du langage et les pi&#xE8;ges &#xE0; &#xE9;viter, l'&#xE9;tude du Document Object Model, sa compr&#xE9;hension, sa manipulation et sa modification constituent la seconde partie, le troisi&#xE8;me th&#xE8;me nous am&#xE8;ne &#xE0; maitriser la programmation &#xE9;v&#xE8;nementielle en &#xE9;tudiant les &#xE9;v&#xE8;nements, leur contexte et la gestion de l'interactivit&#xE9; d'un document. La quatri&#xE8;me partie propose un aper&#xE7;u d'outils compl&#xE9;mentaires  pour un usage futur, l'installation de Node.js comme pr&#xE9;texte &#xE0; la g&#xE9;n&#xE9;ration d'une documentation avec JSDoc3 ou l'utilisation de jQuery avec des manipulations portant sur ses fonctionnalit&#xE9;s indispensables.</p>
        <p>De fa&#xE7;on r&#xE9;guli&#xE8;re des exemples suppl&#xE9;mentaires de code sont pr&#xE9;sents pour pallier &#xE0; un manque de compatibilit&#xE9; entre navigateurs pour des propri&#xE9;t&#xE9;s ou m&#xE9;thodes expos&#xE9;es et comportent la solution adapt&#xE9;e.</p>
        <strong>Travaux dirig&#xE9;s</strong>
        <p>La derni&#xE8;re partie est compos&#xE9;e d'exercices pour valider le cours. Sont pr&#xE9;sents des travaux dirig&#xE9;s qui d&#xE9;taillent des cas pratiques indispensables sur des projets r&#xE9;els en essayant de varier les domaines d'applications. Un module de consentement de cookie, une validation de formulaire puis un chargeur d'images valident les notions &#xE9;tudi&#xE9;es tout au long du livre par la pratique.</p>
      </div>
    </div>
  </body>
</html>